import React from "react";
import styles from './Biography.module.css';

// export function Biography() {
//     return (
//         <p>
//             Народився 10 березня 2003 року в місті Вінниця. Ще до свого повноліття таємно пройшов курс молодого бійця в «Азові». <br /><br />
//             Парамедик, наймолодший серед азовців під час оборони Маріуполя. 19-й день народження зустрів, обороняючи Маріуполь від росіян.<br /><br />
//             20 травня 2022 року командир загону спецпризначення «Азов» Денис Прокопенко повідомив, що на 86-й день кругової оборони Маріуполя був отриманий наказ про припинення оборони міста. Першочергові вимоги про евакуацію цивільних, поранених та загиблих були виконані. Гринцевич, разом зі своїми побратимами, потрапив у полон до росіян, де провів 4 місяці. Після звільнення повернувся на службу.<br /><br />
//             21 вересня 2022 року визволений з полону при обміні військовополоненими. Після звільнення він разом із товаришами заснував підрозділ «Контакт 12». Там «Грєнка» був командиром взводу оптичних спостерігачів.<br /><br />
//             Загинув в бою 6 травня 2024 року. Без Назарія лишились мати, сестра, брат та кохана дівчина Анастасія.<br />
//         </p>);
// }

export class Biography extends React.Component {
    render() {
        return (
            <p>
                Народився 10 березня 2003 року в місті Вінниця. Ще до свого повноліття таємно пройшов курс молодого бійця в «Азові». <br /><br />
                Парамедик, наймолодший серед азовців під час оборони Маріуполя. 19-й день народження зустрів, обороняючи Маріуполь від росіян.<br /><br />
                20 травня 2022 року командир загону спецпризначення «Азов» Денис Прокопенко повідомив, що на 86-й день кругової оборони Маріуполя був отриманий наказ про припинення оборони міста. Першочергові вимоги про евакуацію цивільних, поранених та загиблих були виконані. Гринцевич, разом зі своїми побратимами, потрапив у полон до росіян, де провів 4 місяці. Після звільнення повернувся на службу.<br /><br />
                21 вересня 2022 року визволений з полону при обміні військовополоненими. Після звільнення він разом із товаришами заснував підрозділ «Контакт 12». Там «Грєнка» був командиром взводу оптичних спостерігачів.<br /><br />
                Загинув в бою 6 травня 2024 року. Без Назарія лишились мати, сестра, брат та кохана дівчина Анастасія.<br />
            </p>);
    }
}